# Pandas로 데이터 가공하기
## Pandas 설치 및 사용
## Pandas 객체 소개
### Pandas Series 객체
### Pandas DataFrame 객체
### Pandas Index 객체
## 데이터 인덱싱과 선택
### Series에서 데이터 선택
### DataFrame에서 데이터 선택
### Pandas에서 데이터 연산하기
### 유니버설 함수: 인덱스 보존
### 유니버설 함수: 인덱스 정렬
### 유니버설 함수: DataFrame과 Series 간의 연산
## 누락된 데이터 처리하기
### 누락된 데이터 처리 방식의 트레이드오프
### Pandas에서 누락된 데이터
### 널 값 연산하기
## 계층적 인덱싱
### 다중 인텍스된 Series
### MultiIndex 생성 메서드
### MultiIndex 인덱싱 및 슬라이싱
### 다중 인덱스 재정렬하기
### 다중 인덱스에서 데이터 집계
## 데이터세트 결합: Concat과 Append
### 복습: NumPy 배열 연결
### pd.concat을 이용한 간단한 연결
## 데이터세트 결합하기: 병합과 조인
### 관계 대수
### 조인 작업의 분류
### 병합 키 지정
### 조인을 위한 집합 연산 지정하기
### 열 이름이 겹치는 경우: suffixes 키워드
### 예제: 미국 주 데이터
## 집계와 분류
### 행성 데이터
### Pandas의 간단한 집계 연산
### GroupBy: 분할, 적용, 결합
## 피벗 테이블
### 피벗 테이블 시작
### 피벗 테이블 등장 배경
### 피벗 테이블 구문
### 예제: 출생률 데이터
## 벡터화된 문자열 연산
### Pandas 문자열 연산 소개
### Pandas 문자열 메서드 목록
### 예제: 조리법 데이터베이스
## 시계열 다루기
### 파이썬에서의 날짜와 시간
## Pandas 시계열: 시간으로 인덱싱하기
### Pandas 시계열 데이터 구조
### 주기와 오프셋
### 리샘플링, 시프팅, 윈도잉
### 추가 학습 자료
### 예제: 시애틀 자전거 수 시각화
## 고성능 Pandas: eval()과 Query()
### eval()과 Query()의 등장 배경: 복합 표현식
### 효율적인 연산을 위한 Pandas.eval()
### 열 단위의 연산을 위한 DataFrame.eval()
### DataFrame.query() 메서드
### 성능: 이 함수를 사용해야 하는 경우

# Pandas로 데이터 가공하기
## Pandas 설치 및 사용

In [1]:
import pandas as pd
pd.__version__

'1.2.5'

## Pandas 객체 소개

In [2]:
import numpy as np

### Pandas Series 객체

In [3]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [5]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
data[1]

0.5

In [7]:
data[1:3]

1    0.50
2    0.75
dtype: float64

#### Series: 일반화된 NumPy 배열

In [8]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [9]:
data['c']

0.75

In [10]:
data = pd.Series(np.linspace(.25, 1.0, 4), index=[2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [11]:
data[5]

0.5

#### Series: 특수한 딕셔너리

In [12]:
population_dict = {'California': 38332521, 
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [13]:
population['New York']

19651127

In [14]:
population['California':'Florida']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
dtype: int64

#### Series 객체 구성하기

In [15]:
pd.Series(list(range(2,8,2)))

0    2
1    4
2    6
dtype: int64

In [16]:
pd.Series(99, index=[10, 20, 30, 40, 50])

10    99
20    99
30    99
40    99
50    99
dtype: int64

In [17]:
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

In [18]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[1, 2, 3])

1    b
2    a
3    c
dtype: object

### Pandas DataFrame 객체
#### DataFrame: 일반화된 NumPy 배열

In [19]:
area_dict = {'California': 423967, 
             'Texas': 695662,
             'New York': 141297,
             'Florida': 170312,
             'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [20]:
states = pd.DataFrame({'population': population, 'area': area}, columns=['area', 'population'])
states

              area  population
California  423967    38332521
Texas       695662    26448193
New York    141297    19651127
Florida     170312    19552860
Illinois    149995    12882135

In [21]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [22]:
states.columns

Index(['area', 'population'], dtype='object')

#### DataFrame: 특수한 딕셔너리

In [23]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

#### DataFrame 객체 구성하기

In [24]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [25]:
data = [{'a':i, 'b':2*i, 'c':3*i} for i in range(3)]
pd.DataFrame(data)

   a  b  c
0  0  0  0
1  1  2  3
2  2  4  6

In [26]:
pd.DataFrame([{'a':1, 'b':2},{'b':3, 'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [27]:
pd.DataFrame({'area':area, 'population':population})

              area  population
California  423967    38332521
Texas       695662    26448193
New York    141297    19651127
Florida     170312    19552860
Illinois    149995    12882135

In [28]:
grd = np.random.rand(3,2)
pd.DataFrame(grd, columns=['foo','bar'], index=['a','b','c'])

        foo       bar
a  0.183576  0.642712
b  0.629798  0.146288
c  0.616932  0.400045

In [29]:
pd.DataFrame(grd)

          0         1
0  0.183576  0.642712
1  0.629798  0.146288
2  0.616932  0.400045

In [30]:
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [31]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

### Pandas Index 객체

In [32]:
ind = pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

Index: 불변의 배열

In [33]:
ind[1]

3

In [34]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [35]:
ind.size, ind.shape, ind.ndim, ind.dtype

(5, (5,), 1, dtype('int64'))

In [36]:
ind[1] = 0

TypeError: Index does not support mutable operations

#### Index: 정렬된 집합

In [37]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])
indA.intersection(indB), indA.union(indB), indA.symmetric_difference(indB)

(Int64Index([3, 5, 7], dtype='int64'),
 Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64'),
 Int64Index([1, 2, 9, 11], dtype='int64'))

## 데이터 인덱싱과 선택
### Series에서 데이터 선택
#### Series: 딕셔너리

In [38]:
data = pd.Series(np.linspace(.25,1.0,4), index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [39]:
data['b']

0.5

In [40]:
'a' in data

True

In [41]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [42]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [43]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

#### Series: 1차원 배열

In [44]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [45]:
data[0:2]

a    0.25
b    0.50
dtype: float64

In [46]:
data[(0.5<=data) & (data<=1.0)]

b    0.50
c    0.75
d    1.00
dtype: float64

In [47]:
data[['c','b','c']]

c    0.75
b    0.50
c    0.75
dtype: float64

#### 인덱서: loc, iloc, ix

In [48]:
data = pd.Series(['a','b','c'],index=[1,3,5])
data[1:3]

3    b
5    c
dtype: object

In [49]:
data[1]

'a'

In [50]:
data.loc[1], data.iloc[1]

('a', 'b')

In [51]:
data.loc[1:3],data.iloc[1:3]

(1    a
 3    b
 dtype: object,
 3    b
 5    c
 dtype: object)

### DataFrame에서 데이터 선택
#### DataFrame: 딕셔너리

In [52]:
data = pd.DataFrame({'area':area, 'pop':population})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [53]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [54]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [55]:
data.area is data['area']

True

In [56]:
data.pop is data['pop']

False

In [57]:
data['density'] = data['pop']/data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

#### DataFrame: 2차원 배열

In [58]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [59]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [60]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [61]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [62]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [63]:
data.loc[:'Illinois',:'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [64]:
data.loc[data.density > 100, ['density', 'pop']]

             density       pop
New York  139.076746  19651127
Florida   114.806121  19552860

In [65]:
data.loc[data['density'] > 100, ['density']]

             density
New York  139.076746
Florida   114.806121

In [66]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

#### 추가적인 인덱싱 규칙

In [67]:
data['Texas':'New York']

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [68]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [69]:
data[data['density']>100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [70]:
data[['pop','density']]

                 pop     density
California  38332521   90.000000
Texas       26448193   38.018740
New York    19651127  139.076746
Florida     19552860  114.806121
Illinois    12882135   85.883763

### Pandas에서 데이터 연산하기
### 유니버설 함수: 인덱스 보존

In [ ]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

In [ ]:
df = pd.DataFrame(rng.randint(0, 10,(3,4)),
                  columns=['A','B','C','D'])
df

In [ ]:
np.exp(ser)

In [ ]:
df = np.cos(df * np.pi/4)

In [ ]:
df['B'] = np.arccos(df['B'])
df

### 유니버설 함수: 인덱스 정렬
#### Series에서 인덱스 정렬

In [ ]:
area = pd.Series({'Alaska':1723337,'Texas':695662,'California':423967}, name='area')
population = pd.Series({'California':38332521,'Texas':26448193,'New York':19651127}, name='population')
population/area

In [ ]:
area.index.union(population.index)

In [ ]:
A = pd.Series([2,4,6],index=[0,1,2])
B = pd.Series([1,3,5],index=[1,2,3])
A + B

In [ ]:
A.add(B, fill_value = 0)

#### Dataframe에서 인덱스 정렬

In [ ]:
A = pd.DataFrame(np.random.randint(0,20,(2,2)),columns=list('AB'))
A

In [ ]:
B = pd.DataFrame(np.random.randint(0,10,(3,3)),columns=list('BAC'))
B

In [ ]:
A + B

In [ ]:
A.add(B, fill_value=0)

In [ ]:
A.stack()

In [ ]:
fill = A.stack().mean()
fill

In [ ]:
fill_b = A.mean()
fill_b

In [ ]:
A.add(B,fill_value=fill)

### 유니버설 함수: DataFrame과 Series 간의 연산

In [ ]:
A = np.random.randint(10, size=(3,4))
A

In [ ]:
A - A[0]

In [ ]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

In [ ]:
df.subtract(df['R'],axis=0)

In [ ]:
halfrow = df.iloc[1,::2]
halfrow

In [ ]:
df - halfrow

## 누락된 데이터 처리하기
### 누락된 데이터 처리 방식의 트레이드오프
### Pandas에서 누락된 데이터
#### None: 파이썬의 누락된 데이터

In [ ]:
vals1 = np.array([1, None, 3, 4])
vals1

In [ ]:
for dtype in ['object','int']:
    print("dtype =",dtype)
    %timeit np.arange(1E7, dtype=dtype).sum()
    print()

In [ ]:
vals1.sum()

#### Nan: 누락된 숫자 데이터

In [ ]:
vals2 = np.array([1,np.nan,3,4])
vals2.dtype

In [ ]:
1+np.nan, 0 * np.nan

In [ ]:
vals2.sum(), vals2.min(), vals2.max()

In [ ]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

#### Pandas에서 NaN과 None

In [71]:
pd.Series([1,np.nan,2,None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [72]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [73]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

### 널 값 연산하기
#### 널 값 탐지

In [74]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [76]:
data[data.notnull()]

0        1
2    hello
dtype: object

#### 널 값 제거하기

In [77]:
data.dropna()

0        1
2    hello
dtype: object

In [78]:
df = pd.DataFrame([[1,np.nan,2],
                  [2,3,5],
                  [np.nan,4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [79]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [80]:
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [81]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [83]:
df.dropna(axis='columns',how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [86]:
df.dropna(thresh=2)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

#### 널 값 채우기

In [87]:
data = pd.Series([1,np.nan,2,None,3], index=list('abced'))
data

a    1.0
b    NaN
c    2.0
e    NaN
d    3.0
dtype: float64

In [88]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
e    0.0
d    3.0
dtype: float64

In [89]:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
e    2.0
d    3.0
dtype: float64

In [90]:
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
e    3.0
d    3.0
dtype: float64

In [91]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [92]:
df.fillna(method='ffill',axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

## 계층적 인덱싱
### 다중 인텍스된 Series
#### 나쁜 방식

In [100]:
index = [('California',2000),('California',2010),('New York',2000),('New York',2010),('Texas',2000),('Texas',2010)]
populations = [33871648, 37253956, 18976457,19378102,20851820,25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [101]:
pop[('California',2010):('Texas',2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [102]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

#### 더 나은 방식: Pandas MultiIndex

In [103]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [109]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [110]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

#### MultiIndex: 추가 차원

In [112]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [113]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [114]:
pop_df = pd.DataFrame({'total':pop,
                       'under18':[9267089,9284094,4687374,4318033,5906301,6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [117]:
f_u18 = pop_df['under18']/pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

### MultiIndex 생성 메서드

In [118]:
df = pd.DataFrame(np.random.rand(4,2),index=[['a','a','b','b'],[1,2,1,2]],columns=['data1','data2'])
df

        data1     data2
a 1  0.384451  0.873823
  2  0.185141  0.127060
b 1  0.093807  0.882569
  2  0.220129  0.185788

In [120]:
data = {('California',2000):33871648,('California',2010):37253956,('Texas',2000):20851820,('Texas',2010):25145561,('New York',2000):18976457,('New York',2010):19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

#### 명시적 MultiIndex 생성자

In [125]:
mi = pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])
mi

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [134]:
tuples = mi.to_list()
pd.MultiIndex.from_tuples(tuples)

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [135]:
pd.MultiIndex.from_product([['a','b'],[1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

#### MultiIndex 레벨 이름

In [137]:
pop.index.names = ['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

#### 열의 MultiIndex

In [141]:
index = pd.MultiIndex.from_product([[2013,2014],[1,2]], names=['year','visit'])
columns = pd.MultiIndex.from_product([['Bob','Guido','Sue'],['HR','Temp']],names=['subject','type'])
data = np.round(np.random.randn(4,6),1)
data[:,::2] *= 5
data += 36.5
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      36.0  37.5  30.5  36.5  31.5  37.6
     2      32.5  37.4  36.0  38.0  49.0  37.3
2014 1      32.5  36.8  37.0  35.9  28.5  37.3
     2      41.0  37.3  34.5  37.1  34.5  36.8

In [142]:
health_data['Sue']

type          HR  Temp
year visit
2013 1      31.5  37.6
     2      49.0  37.3
2014 1      28.5  37.3
     2      34.5  36.8

### MultiIndex 인덱싱 및 슬라이싱
#### 다중 인덱스를 가진 Series

In [143]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [145]:
pop['California',2000]

33871648

In [146]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [148]:
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [150]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [151]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [152]:
pop[['California','Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

#### 다중 인덱스를 가진 DataFrame

In [153]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      36.0  37.5  30.5  36.5  31.5  37.6
     2      32.5  37.4  36.0  38.0  49.0  37.3
2014 1      32.5  36.8  37.0  35.9  28.5  37.3
     2      41.0  37.3  34.5  37.1  34.5  36.8

In [154]:
health_data['Guido','HR']

year  visit
2013  1        30.5
      2        36.0
2014  1        37.0
      2        34.5
Name: (Guido, HR), dtype: float64

In [156]:
health_data.iloc[:1,:1]

subject      Bob
type          HR
year visit
2013 1      36.0

In [157]:
health_data.iloc[:2,:2]

subject      Bob
type          HR  Temp
year visit
2013 1      36.0  37.5
     2      32.5  37.4

In [160]:
health_data.loc[:,('Bob','Temp')]

year  visit
2013  1        37.5
      2        37.4
2014  1        36.8
      2        37.3
Name: (Bob, Temp), dtype: float64

In [162]:
idx = pd.IndexSlice
health_data.loc[idx[:,1],idx[:,'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      36.0  30.5  31.5
2014 1      32.5  37.0  28.5

### 다중 인덱스 재정렬하기
#### 정렬된 인덱스와 정렬되지 않은 인덱스

In [173]:
index = pd.MultiIndex.from_product([['a','c','b'],[1,2]])
data = pd.Series(np.random.rand(6),index=index)
data.index.names = ['char','int']
data

char  int
a     1      0.392248
      2      0.616342
c     1      0.599367
      2      0.089253
b     1      0.476769
      2      0.746252
dtype: float64

In [174]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [175]:
data = data.sort_index()
data

char  int
a     1      0.392248
      2      0.616342
b     1      0.476769
      2      0.746252
c     1      0.599367
      2      0.089253
dtype: float64

In [176]:
data['a':'b']

char  int
a     1      0.392248
      2      0.616342
b     1      0.476769
      2      0.746252
dtype: float64

#### 인덱스 스태킹 및 언스태킹

In [177]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [178]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [179]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

#### 인덱스 설정 및 재설정

In [180]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [181]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

### 다중 인덱스에서 데이터 집계

In [182]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      36.0  37.5  30.5  36.5  31.5  37.6
     2      32.5  37.4  36.0  38.0  49.0  37.3
2014 1      32.5  36.8  37.0  35.9  28.5  37.3
     2      41.0  37.3  34.5  37.1  34.5  36.8

In [183]:
data_mean = health_data.mean(level='year')
data_mean

subject    Bob         Guido           Sue
type        HR   Temp     HR   Temp     HR   Temp
year
2013     34.25  37.45  33.25  37.25  40.25  37.45
2014     36.75  37.05  35.75  36.50  31.50  37.05

In [184]:
data_mean.mean(axis=1,level='type')

type         HR       Temp
year
2013  35.916667  37.383333
2014  34.666667  36.866667

## 데이터세트 결합: Concat과 Append

In [185]:
def make_df(cols,ind):
    data = {c : [str(c)+str(i) for i in ind] for c in cols}
    return pd.DataFrame(data,ind)

make_df('ABC',range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

### 복습: NumPy 배열 연결

In [191]:
x = list(range(3))
y = list(range(3,6))
z = list(range(6,9))
np.concatenate([x,y,z]),np.concatenate([[x],[y],[z]])

(array([0, 1, 2, 3, 4, 5, 6, 7, 8]),
 array([[0, 1, 2],
        [3, 4, 5],
        [6, 7, 8]]))

In [193]:
x = [[1,2],[3,4]]
np.concatenate([x,x],axis=1),np.concatenate([x,x],axis=0)

(array([[1, 2, 1, 2],
        [3, 4, 3, 4]]),
 array([[1, 2],
        [3, 4],
        [1, 2],
        [3, 4]]))

### pd.concat을 이용한 간단한 연결

In [197]:
ser1 = pd.Series(list('ABC'),index=[1,2,3])
ser2 = pd.Series(list('DEF'),index=[4,5,6])
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [198]:
df1 = make_df('AB',[1,2])
df2 = make_df('AB',[3,4])
df1,df2,pd.concat([df1,df2])

(    A   B
 1  A1  B1
 2  A2  B2,
     A   B
 3  A3  B3
 4  A4  B4,
     A   B
 1  A1  B1
 2  A2  B2
 3  A3  B3
 4  A4  B4)

In [199]:
df3 = make_df('AB',[0,1])
df4 = make_df('CD',[0,1])
df3,df4,pd.concat([df3,df4],axis=1)

(    A   B
 0  A0  B0
 1  A1  B1,
     C   D
 0  C0  D0
 1  C1  D1,
     A   B   C   D
 0  A0  B0  C0  D0
 1  A1  B1  C1  D1)

#### 인덱스 복제

In [200]:
x = make_df('AB',[0,1])
y = make_df('AB',[2,3])
y.index = x.index
x,y,pd.concat([x,y])

(    A   B
 0  A0  B0
 1  A1  B1,
     A   B
 0  A2  B2
 1  A3  B3,
     A   B
 0  A0  B0
 1  A1  B1
 0  A2  B2
 1  A3  B3)

In [201]:
try:
    pd.concat([x,y],verify_integrity=True)
except ValueError as e:
    print(e)

Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

In [202]:
x,y,pd.concat([x,y],ignore_index=True)

(    A   B
 0  A0  B0
 1  A1  B1,
     A   B
 0  A2  B2
 1  A3  B3,
     A   B
 0  A0  B0
 1  A1  B1
 2  A2  B2
 3  A3  B3)

In [203]:
x,y,pd.concat([x,y],keys=['x','y'])

(    A   B
 0  A0  B0
 1  A1  B1,
     A   B
 0  A2  B2
 1  A3  B3,
       A   B
 x 0  A0  B0
   1  A1  B1
 y 0  A2  B2
   1  A3  B3)

#### 조인을 이용한 연결

In [208]:
df5 = make_df('ABC', [1,2])
df6 = make_df('BCD', [3,4])
df5,df6,pd.concat([df5,df6])

(    A   B   C
 1  A1  B1  C1
 2  A2  B2  C2,
     B   C   D
 3  B3  C3  D3
 4  B4  C4  D4,
      A   B   C    D
 1   A1  B1  C1  NaN
 2   A2  B2  C2  NaN
 3  NaN  B3  C3   D3
 4  NaN  B4  C4   D4)

In [209]:
df5,df6,pd.concat([df5,df6],join='inner')

(    A   B   C
 1  A1  B1  C1
 2  A2  B2  C2,
     B   C   D
 3  B3  C3  D3
 4  B4  C4  D4,
     B   C
 1  B1  C1
 2  B2  C2
 3  B3  C3
 4  B4  C4)

#### append() 메서드

In [211]:
df1,df2,df1.append(df2)

(    A   B
 1  A1  B1
 2  A2  B2,
     A   B
 3  A3  B3
 4  A4  B4,
     A   B
 1  A1  B1
 2  A2  B2
 3  A3  B3
 4  A4  B4)

## 데이터세트 결합하기: 병합과 조인
### 관계 대수
### 조인 작업의 분류
#### 일대일 조인

In [221]:
df1 = pd.DataFrame({'employee':['Lisa','Miwako','Ayoung','Sue'], 'group':['Accounting','Engineering','Engineering','HR']})
df2 = pd.DataFrame({'employee':['Ayoung','Sue','Miwako','Lisa'], 'hire_date':[2004,2008,2012,2016]})
df1,df2

(  employee        group
 0     Lisa   Accounting
 1   Miwako  Engineering
 2   Ayoung  Engineering
 3      Sue           HR,
   employee  hire_date
 0   Ayoung       2004
 1      Sue       2008
 2   Miwako       2012
 3     Lisa       2016)

In [222]:
df3 = pd.merge(df1,df2)
df3

  employee        group  hire_date
0     Lisa   Accounting       2016
1   Miwako  Engineering       2012
2   Ayoung  Engineering       2004
3      Sue           HR       2008

#### 다대일(Many-to-one) 조인

In [223]:
df4 = pd.DataFrame({'group':['Accounting','Engineering','HR'],
                    'supervisor':['Sanae','Jinsu','Guido']})
df3,df4,pd.merge(df3, df4)

(  employee        group  hire_date
 0     Lisa   Accounting       2016
 1   Miwako  Engineering       2012
 2   Ayoung  Engineering       2004
 3      Sue           HR       2008,
          group supervisor
 0   Accounting      Sanae
 1  Engineering      Jinsu
 2           HR      Guido,
   employee        group  hire_date supervisor
 0     Lisa   Accounting       2016      Sanae
 1   Miwako  Engineering       2012      Jinsu
 2   Ayoung  Engineering       2004      Jinsu
 3      Sue           HR       2008      Guido)

#### 다대다(Many-to-many) 조인

In [225]:
df5 = pd.DataFrame({'group':['Accounting','Accounting','Engineering','Engineering','HR','HR'],
                    'skills':['math','spreadsheets','coding','linux','spreadsheets','organization']})
df1,df5,pd.merge(df1,df5)

(  employee        group
 0     Lisa   Accounting
 1   Miwako  Engineering
 2   Ayoung  Engineering
 3      Sue           HR,
          group        skills
 0   Accounting          math
 1   Accounting  spreadsheets
 2  Engineering        coding
 3  Engineering         linux
 4           HR  spreadsheets
 5           HR  organization,
   employee        group        skills
 0     Lisa   Accounting          math
 1     Lisa   Accounting  spreadsheets
 2   Miwako  Engineering        coding
 3   Miwako  Engineering         linux
 4   Ayoung  Engineering        coding
 5   Ayoung  Engineering         linux
 6      Sue           HR  spreadsheets
 7      Sue           HR  organization)

### 병합 키 지정
#### on 키워드

In [226]:
df1,df2,pd.merge(df1,df2, on='employee')

(  employee        group
 0     Lisa   Accounting
 1   Miwako  Engineering
 2   Ayoung  Engineering
 3      Sue           HR,
   employee  hire_date
 0   Ayoung       2004
 1      Sue       2008
 2   Miwako       2012
 3     Lisa       2016,
   employee        group  hire_date
 0     Lisa   Accounting       2016
 1   Miwako  Engineering       2012
 2   Ayoung  Engineering       2004
 3      Sue           HR       2008)

#### left_on과 right_on 키워드

In [228]:
df3 = pd.DataFrame({'name':['Miwako','Ayoung','Lisa','Sue'],'salary':[50000,125000,63000,90000]})
df1,df3,pd.merge(df1,df3,left_on='employee',right_on='name')

(  employee        group
 0     Lisa   Accounting
 1   Miwako  Engineering
 2   Ayoung  Engineering
 3      Sue           HR,
      name  salary
 0  Miwako   50000
 1  Ayoung  125000
 2    Lisa   63000
 3     Sue   90000,
   employee        group    name  salary
 0     Lisa   Accounting    Lisa   63000
 1   Miwako  Engineering  Miwako   50000
 2   Ayoung  Engineering  Ayoung  125000
 3      Sue           HR     Sue   90000)

In [230]:
pd.merge(df1,df3,left_on='employee',right_on='name').drop('name',axis=1)

  employee        group  salary
0     Lisa   Accounting   63000
1   Miwako  Engineering   50000
2   Ayoung  Engineering  125000
3      Sue           HR   90000

#### left_index와 right_index 키워드

In [231]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
df1a,df2a

(                group
 employee
 Lisa       Accounting
 Miwako    Engineering
 Ayoung    Engineering
 Sue                HR,
           hire_date
 employee
 Ayoung         2004
 Sue            2008
 Miwako         2012
 Lisa           2016)

In [232]:
pd.merge(df1a,df2a,left_index=True,right_index=True)

                group  hire_date
employee
Lisa       Accounting       2016
Miwako    Engineering       2012
Ayoung    Engineering       2004
Sue                HR       2008

In [233]:
df1a,df2a,df1a.join(df2a)

(                group
 employee
 Lisa       Accounting
 Miwako    Engineering
 Ayoung    Engineering
 Sue                HR,
           hire_date
 employee
 Ayoung         2004
 Sue            2008
 Miwako         2012
 Lisa           2016,
                 group  hire_date
 employee
 Lisa       Accounting       2016
 Miwako    Engineering       2012
 Ayoung    Engineering       2004
 Sue                HR       2008)

In [235]:
df1a,df3,pd.merge(df1a,df3,left_index=True,right_on='name')

(                group
 employee
 Lisa       Accounting
 Miwako    Engineering
 Ayoung    Engineering
 Sue                HR,
      name  salary
 0  Miwako   50000
 1  Ayoung  125000
 2    Lisa   63000
 3     Sue   90000,
          group    name  salary
 2   Accounting    Lisa   63000
 0  Engineering  Miwako   50000
 1  Engineering  Ayoung  125000
 3           HR     Sue   90000)

### 조인을 위한 집합 연산 지정하기

In [236]:
df6 = pd.DataFrame({'name':['Miwako','Anna','Mary'],'food':['fish','beans','bread']},columns=['name','food'])
df7 = pd.DataFrame({'name':['Mary','Momo'],'drink':['wine','beer']},columns=['name','drink'])
df6,df7,pd.merge(df6,df7)

(     name   food
 0  Miwako   fish
 1    Anna  beans
 2    Mary  bread,
    name drink
 0  Mary  wine
 1  Momo  beer,
    name   food drink
 0  Mary  bread  wine)

In [237]:
pd.merge(df6,df7,how='inner')

   name   food drink
0  Mary  bread  wine

In [238]:
pd.merge(df6,df7,how='outer')

     name   food drink
0  Miwako   fish   NaN
1    Anna  beans   NaN
2    Mary  bread  wine
3    Momo    NaN  beer

In [239]:
pd.merge(df6,df7,how='left')

     name   food drink
0  Miwako   fish   NaN
1    Anna  beans   NaN
2    Mary  bread  wine

In [240]:
pd.merge(df6,df7,how='right')

   name   food drink
0  Mary  bread  wine
1  Momo    NaN  beer

### 열 이름이 겹치는 경우: suffixes 키워드

In [242]:
df8 = pd.DataFrame({'name':['Miwako','Ayoung','Sanae','Anna'],'rank':[1,2,3,4]})
df9 = pd.DataFrame({'name':['Miwako','Ayoung','Sanae','Anna'],'rank':[3,1,4,2]})
df8,df9,pd.merge(df8,df9,on="name")

(     name  rank
 0  Miwako     1
 1  Ayoung     2
 2   Sanae     3
 3    Anna     4,
      name  rank
 0  Miwako     3
 1  Ayoung     1
 2   Sanae     4
 3    Anna     2,
      name  rank_x  rank_y
 0  Miwako       1       3
 1  Ayoung       2       1
 2   Sanae       3       4
 3    Anna       4       2)

In [243]:
pd.merge(df8,df9,on="name",suffixes=['_L','_R'])

     name  rank_L  rank_R
0  Miwako       1       3
1  Ayoung       2       1
2   Sanae       3       4
3    Anna       4       2

### 예제: 미국 주 데이터

In [244]:
pop = pd.read_csv('data/state-population.csv')
areas = pd.read_csv('data/state-areas.csv')
abbrevs = pd.read_csv('data/state-abbrevs.csv')
pop.head(),areas.head(),abbrevs.head()

(  state/region     ages  year  population
 0           AL  under18  2012   1117489.0
 1           AL    total  2012   4817528.0
 2           AL  under18  2010   1130966.0
 3           AL    total  2010   4785570.0
 4           AL  under18  2011   1125763.0,
         state  area (sq. mi)
 0     Alabama          52423
 1      Alaska         656425
 2     Arizona         114006
 3    Arkansas          53182
 4  California         163707,
         state abbreviation
 0     Alabama           AL
 1      Alaska           AK
 2     Arizona           AZ
 3    Arkansas           AR
 4  California           CA)

In [256]:
merged = pd.merge(abbrevs,pop,how='outer',left_on='abbreviation',right_on='state/region').drop('abbreviation',axis=1)
merged.head()

     state state/region     ages  year  population
0  Alabama           AL  under18  2012   1117489.0
1  Alabama           AL    total  2012   4817528.0
2  Alabama           AL  under18  2010   1130966.0
3  Alabama           AL    total  2010   4785570.0
4  Alabama           AL  under18  2011   1125763.0

In [257]:
merged.isnull().any()

state            True
state/region    False
ages            False
year            False
population       True
dtype: bool

In [260]:
merged[merged['population'].isnull()]

     state state/region     ages  year  population
2448   NaN           PR  under18  1990         NaN
2449   NaN           PR    total  1990         NaN
2450   NaN           PR    total  1991         NaN
2451   NaN           PR  under18  1991         NaN
2452   NaN           PR    total  1993         NaN
2453   NaN           PR  under18  1993         NaN
2454   NaN           PR  under18  1992         NaN
2455   NaN           PR    total  1992         NaN
2456   NaN           PR  under18  1994         NaN
2457   NaN           PR    total  1994         NaN
2458   NaN           PR    total  1995         NaN
2459   NaN           PR  under18  1995         NaN
2460   NaN           PR  under18  1996         NaN
2461   NaN           PR    total  1996         NaN
2462   NaN           PR  under18  1998         NaN
2463   NaN           PR    total  1998         NaN
2464   NaN           PR    total  1997         NaN
2465   NaN           PR  under18  1997         NaN
2466   NaN           PR    total  1999         NaN
2467   NaN           PR  under18  1999         NaN

In [263]:
merged[merged['state'].isnull()]

     state state/region     ages  year   population
2448   NaN           PR  under18  1990          NaN
2449   NaN           PR    total  1990          NaN
2450   NaN           PR    total  1991          NaN
2451   NaN           PR  under18  1991          NaN
2452   NaN           PR    total  1993          NaN
...    ...          ...      ...   ...          ...
2539   NaN          USA    total  2010  309326295.0
2540   NaN          USA  under18  2011   73902222.0
2541   NaN          USA    total  2011  311582564.0
2542   NaN          USA  under18  2012   73708179.0
2543   NaN          USA    total  2012  313873685.0

[96 rows x 5 columns]

In [269]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United State'
merged.head()

     state state/region     ages  year  population
0  Alabama           AL  under18  2012   1117489.0
1  Alabama           AL    total  2012   4817528.0
2  Alabama           AL  under18  2010   1130966.0
3  Alabama           AL    total  2010   4785570.0
4  Alabama           AL  under18  2011   1125763.0

In [270]:
final = pd.merge(merged,areas,on='state',how='left')
final.head()

     state state/region     ages  year  population  area (sq. mi)
0  Alabama           AL  under18  2012   1117489.0        52423.0
1  Alabama           AL    total  2012   4817528.0        52423.0
2  Alabama           AL  under18  2010   1130966.0        52423.0
3  Alabama           AL    total  2010   4785570.0        52423.0
4  Alabama           AL  under18  2011   1125763.0        52423.0

In [271]:
final.isnull().any()

state            False
state/region     False
ages             False
year             False
population        True
area (sq. mi)     True
dtype: bool

In [275]:
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United State'], dtype=object)

In [276]:
final.dropna(inplace=True)
final.head()

     state state/region     ages  year  population  area (sq. mi)
0  Alabama           AL  under18  2012   1117489.0        52423.0
1  Alabama           AL    total  2012   4817528.0        52423.0
2  Alabama           AL  under18  2010   1130966.0        52423.0
3  Alabama           AL    total  2010   4785570.0        52423.0
4  Alabama           AL  under18  2011   1125763.0        52423.0

In [277]:
final.isnull().any()

state            False
state/region     False
ages             False
year             False
population       False
area (sq. mi)    False
dtype: bool

In [278]:
data2010 = final.query("year==2010 & ages=='total'")
data2010.head()

          state state/region   ages  year  population  area (sq. mi)
3       Alabama           AL  total  2010   4785570.0        52423.0
91       Alaska           AK  total  2010    713868.0       656425.0
101     Arizona           AZ  total  2010   6408790.0       114006.0
189    Arkansas           AR  total  2010   2922280.0        53182.0
197  California           CA  total  2010  37333601.0       163707.0

In [279]:
data2010.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 52 entries, 3 to 2490
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   state          52 non-null     object
 1   state/region   52 non-null     object
 2   ages           52 non-null     object
 3   year           52 non-null     int64
 4   population     52 non-null     float64
 5   area (sq. mi)  52 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 2.8+ KB

In [281]:
density = data2010['population']/data2010['area (sq. mi)']
density.head()

state
Alabama        91.287603
Alaska          1.087509
Arizona        56.214497
Arkansas       54.948667
California    228.051342
dtype: float64

In [282]:
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [283]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

## 집계와 분류
### 행성 데이터

In [284]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [285]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

### Pandas의 간단한 집계 연산

In [286]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [287]:
ser.sum(),ser.mean()

(2.811925491708157, 0.5623850983416314)

In [288]:
df = pd.DataFrame({'A':rng.rand(5),'B':rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [289]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [291]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [292]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

### GroupBy: 분할, 적용, 결합
#### 분할, 적용, 결합

In [293]:
df = pd.DataFrame({'key':list('ABCABC'), 'data':range(6)}, columns = ['key','data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [294]:
df.groupby('key')

In [295]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [300]:
df.groupby('key').std()

        data
key
A    2.12132
B    2.12132
C    2.12132

#### GroupBy 객체

In [301]:
planets.groupby('method')

In [302]:
planets.groupby('method')['orbital_period']

In [305]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [306]:
for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [310]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

#### 집계, 필터, 변환, 적용

In [311]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key':list('ABCABC'),'data1':range(6),'data2':rng.randint(0,10,6)},columns=['key','data1','data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [314]:
df.groupby('key').aggregate([min,np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [315]:
df.groupby('key').aggregate({'data1':min,'data2':max})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [317]:
def filter_func(x):
    return x['data2'].std() >4
df, df.groupby('key').std(),df.groupby('key').filter(filter_func),df.groupby('key').filter(lambda x:x['data2'].std()>4)

(  key  data1  data2
 0   A      0      5
 1   B      1      0
 2   C      2      3
 3   A      3      3
 4   B      4      7
 5   C      5      9,
        data1     data2
 key
 A    2.12132  1.414214
 B    2.12132  4.949747
 C    2.12132  4.242641,
   key  data1  data2
 1   B      1      0
 2   C      2      3
 4   B      4      7
 5   C      5      9,
   key  data1  data2
 1   B      1      0
 2   C      2      3
 4   B      4      7
 5   C      5      9)

In [319]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [321]:
def norm_by_data2(x):
    x['data1' ] /= x['data2'].sum()
    return x
df,df.groupby('key').apply(norm_by_data2)

(  key  data1  data2
 0   A      0      5
 1   B      1      0
 2   C      2      3
 3   A      3      3
 4   B      4      7
 5   C      5      9,
   key     data1  data2
 0   A  0.000000      5
 1   B  0.142857      0
 2   C  0.166667      3
 3   A  0.375000      3
 4   B  0.571429      7
 5   C  0.416667      9)

#### 분할 키 지정하기

In [322]:
L = [0,1,0,1,2,0]
df, df.groupby(L).sum()

(  key  data1  data2
 0   A      0      5
 1   B      1      0
 2   C      2      3
 3   A      3      3
 4   B      4      7
 5   C      5      9,
    data1  data2
 0      7     17
 1      4      3
 2      4      7)

In [323]:
df,df.groupby(df['key']).sum(),df.groupby('key').sum()

(  key  data1  data2
 0   A      0      5
 1   B      1      0
 2   C      2      3
 3   A      3      3
 4   B      4      7
 5   C      5      9,
      data1  data2
 key
 A        3      8
 B        5      7
 C        7     12,
      data1  data2
 key
 A        3      8
 B        5      7
 C        7     12)

In [324]:
df2 = df.set_index('key')
mapping = {'A':'vowel','B':'consonant','C':'consonant'}
df2,df2.groupby(mapping).sum()

(     data1  data2
 key
 A        0      5
 B        1      0
 C        2      3
 A        3      3
 B        4      7
 C        5      9,
            data1  data2
 consonant     12     19
 vowel          3      8)

In [325]:
df2,df2.groupby(str.lower).mean()

(     data1  data2
 key
 A        0      5
 B        1      0
 C        2      3
 A        3      3
 B        4      7
 C        5      9,
    data1  data2
 a    1.5    4.0
 b    2.5    3.5
 c    3.5    6.0)

In [326]:
df2.groupby([str.lower,mapping]).mean()

             data1  data2
a vowel        1.5    4.0
b consonant    2.5    3.5
c consonant    3.5    6.0

#### 분류(Grouping) 예제

In [330]:
decade = 10 * (planets['year']//10)
decade = decade.astype(str) + 's'
decade.name = 'decade'
planets.groupby(['method',decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

## 피벗 테이블
### 피벗 테이블 시작
### 피벗 테이블 등장 배경
### 피벗 테이블 구문
### 예제: 출생률 데이터
## 벡터화된 문자열 연산
### Pandas 문자열 연산 소개
### Pandas 문자열 메서드 목록
### 예제: 조리법 데이터베이스
## 시계열 다루기
### 파이썬에서의 날짜와 시간
## Pandas 시계열: 시간으로 인덱싱하기
### Pandas 시계열 데이터 구조
### 주기와 오프셋
### 리샘플링, 시프팅, 윈도잉
### 추가 학습 자료
### 예제: 시애틀 자전거 수 시각화
## 고성능 Pandas: eval()과 Query()
### eval()과 Query()의 등장 배경: 복합 표현식
### 효율적인 연산을 위한 Pandas.eval()
### 열 단위의 연산을 위한 DataFrame.eval()
### DataFrame.query() 메서드
### 성능: 이 함수를 사용해야 하는 경우